{
	"Changes":[
		{
			"LogName":"Year 3 Festival Egg Festival - spring13.xnb",
			"Action":"EditData",
			"Target":"Data/Festivals/spring13.xnb",
			"Entries":{
				"Abigail":"Sam? Sebastian? Did you guys even try last year?",
				"Robin":"Hey, @. Good to see you here.#$e#You must be in full swing with your crops by now, huh?",
				"Demetrius":"Gus's buffet is pretty spectacular this year. Are any of the eggs in there from your farm?",
				"Maru":"I think I'll give the egg hunt another shot this year. Why not?$h",
				"Sebastian":"Sure, I like games, but egg hunts are just a bit simple for me.#$b#If I'm going to play a game, there needs to be some kind of depth to it. You know? Context, narrative, that kind of stuff.",
				"Linus":"It's worth it to brave the looks people give me, if it means I get to eat something delicious.",
				"Caroline":"Did you visit Pierre's kiosk yet?$h",
				"Alex":"Maybe I overdid it a bit with the buffet this year... but it'll be easy to work it off.#$e#I could go for a run later tonight.",
				"George":"It was another rerun on TV. But this festival is like a rerun, too, so y'all should be thankful I'm here.",
				"Evelyn":"Oh George. You like the free food and you know it.",
				"Clint":"I made sure to get here extra early this year, before everyone else raided the buffet. I really had my fill.$h#$e#Wait... does that mean I hogged someone else's share?$s",
				"Penny":"We did an egg-decorating art project earlier in the week. If you see a purple one, it might be Jas's, and one of the yellow ones is Vincent's.",
				"Pam":"I've done this festival so many times, it's tough to remember 'em all.#$e#Why? Did anything interesting happen last year?",
				"Emily":"I glued some costume jewels to a few of the eggs that I decorated this year. I hope you like the patterns.$h#$e#Nope, they're not worth any extra points. They're just fancy.",
				"Haley":"Deviled eggs are so gross and slimy.#$b#What, do you like them, too, or something?$s",
				"Jodi":"Sounds like Emily really puts her heart and soul into this festival.$h#$e#Maybe I need a new hobby, too.",
				"Marlon":"I come to every festival, but I have to wonder whether some of these people even know who I am...",
				"Sam":"*sniff* ...Hey, it's hard to go crawling in the bushes for eggs when you've got a full-blown sneezing fit going on.$s",
				"Leah":"Where's that punch from a couple years ago? That stuff was to die for.#$e#Yeah, I know why it was good. I'm not dense.$h#$e#Okay, well, maybe it took a few glasses for me to figure it out.$u#$b#But it was worth it!",
				"Shane":"I always feel a little better at this festival. All the hard work I actually care about finally pays off.#$e#Hey, you enjoy.$h",
				"Marnie":"Shane was a big help this year. I'd say he just about put more work into making it happen this year than I did!$h",
				"Elliott":"Across cultures, eggs symbolize the promise of perpetual life through rebirth.#$b#For us here, the festivities breathe new life into the human spirit. We all relate to the beauty of it on a subconscious level.$h",
				"Gus":"That's right! Fried eggs, boiled eggs, poached eggs, deviled eggs, scrambled eggs, chocolate eggs... you name it!#$e#I hope I lived up to last year's feast.$h",
				"Harvey":"Mayor Lewis is letting me help hide a few eggs this year. I've been scouting some good locations.#$e#Oh, you're participating? Well... who knows? Maybe I won't hide them where you think I will!",
				"Jas":"Maybe I should just team up with Vincent and we can split the prize?#$e#Hmm... maybe not. That's probably not allowed.",
				"Vincent":"I heard the prize might be a ticket to Mr. Lewis's prize machine! There could be anything in there!#$e#What if the prize machine could even give you a prize machine?#$b#Then it could make, like... infinity number of prizes!$h",
				"Willy":"The children of this town don't care too much for what I spend most of my time doing. And that's fine.#$b#Helping out with this event helps me connect with them a little, even if indirectly.$h",
				"Kent":"I'll help clean up when the event wraps up. It's the least I can do.",
				"Leo":"Did you know ostriches used to live on Ginger Island? That's what the parrots told me.#$e#Their eggs are so huge! You could probably fit your head inside if you tried.$h",
				"Abigail_y2": "Are you bringing your A-game again this year?$1",
				"Robin_y2": "@, what do you think? Could %farm farm use another coop?#$e#I'm on board if you are!$1",
				"Demetrius_y2": "The grass in the valley is very nutritious for chickens, certainly better than the corn they're fed on most other farms.",
				"Maru_y2": "Leah and I were trying to come up with egg-themed lesson ideas for Penny. It's tough when Jas already knows just about everything about them.",
				"Sebastian_y2": "This festival must look really bizarre to someone with zero context for it.#$b#An entire day we're supposed to take, so we can talk about... eggs. I mean, really?#$e#What was it like, anyway, your first year here?",
				"Linus_y2": "When everyone else is done, I'll help myself to modest portions. Hopefully, Gus will have some leftovers I can take home.",
				"Caroline_y2": "You must have a lot of cash stockpiled. Is there anything we have for sale that you don't already own?",
				"Alex_y2": "I wonder who was the first person to look at an egg come out of a chicken and think, 'Whoa, dude, that looks delicious.'$2#$e#Hey, I'm not complaining. It just must've been weird the first time that ever happened.$1",
				"George_y2": "Half the town would make a fuss over it if I stayed in. I figured it's easier just to get this over with.",
				"Evelyn_y2": "How many years have you been here now, dear?#$b#Well, I sure am glad you decided to stay. It's important for George and I to know Pelican Town's got a future.",
				"Lewis_y2": "How's your spring so far, @? Everything going as planned?$1",
				"Clint_y2": "I just went ahead and took one of everything this year. Nobody'll get mad, right?",
				"Penny_y2": "Watching the kids enjoy this festival gives me just as much fun as I had when I was little.$1#$e#Life is anything but 'all downhill' after you grow up yourself.",
				"Pam_y2": "I wonder if Gus'll teach me some of his recipes someday?",
				"Emily_y2": "I use the same dyeing kit for clothing as I do with the eggs. Turns out, it works pretty well!#$e#I figured that one out years ago.",
				"Haley_y2": "Hee hee... Are you going to get your picture in the bunny face? I dare you.$1#$e#In return... I'll eat a deviled egg. Even though it'll probably be gross.#$e#...At some point, I will.#$e#...Eventually.",
				"Jodi_y2": "We're already almost halfway through spring, aren't we? Seems like the new year started just a couple of days ago.",
				"Kent_y2": "I'm still not big on this festival much, myself, but it has been nice to see Vincent in such a good mood.",
				"Marlon_y2": "Many years ago, I took on a whole horde of Pepper Rexes while looking for a dinosaur egg.#$e#I emerged victorious, of course, but those eggs are always a rare find.",
				"Sam_y2": "I took some allergy medication this morning. Now I feel kind of loopy.#$e#It always hits me on the day of this festival, for some reason. Maybe it's just from spending so much time outside.",
				"Leah_y2": "I got out my tiniest paintbrushes and I made a little flowery meadow on one of the eggs. If one of the kids finds it, I bet it'd be extra special.",
				"Shane_y2": "If you want good birds who lay the best eggs, you've just gotta give 'em the life they deserve.#$e#This festival would never work with a bunch of factory-farmed eggs. Never in a million years.",
				"Marnie_y2": "I think things turned out pretty well this year!$1#$e#I think the only improvement would be if Gus made one of his famous giant omelets.",
				"Elliott_y2": "This environment isn't particularly inspiring to me in the literary sense, but I am enjoying myself quite 	nicely.$1",
				"Gus_y2": "We've got all the usual fixins here today. I improved my deviled egg recipe a bit, though, so that's something new. Give 'em a try!",
				"Harvey_y2": "This year, I was looking forward to the egg festival like it's an old family tradition.#$b#I'm really lucky I wound up in this town.",
				"Jas_y2": "I'll do the egg hunt, but I think I'll just look for the eggs I decorated.#$e#It's too hard to compete with grown ups.",
				"Vincent_y2": "Me'n Dad already did an egg hunt in our house this morning.#$e#This one's more fun, though.",
				"Willy_y2": "I thought I'd bring in a sample platter o' my homemade caviar, but it'd be a bit expensive to have enough for everyone.",
				"Leo_y2": "What if I kept some of these eggs to decorate my nest? That could be nice."
				}
		},
		{
			"LogName":"Year 3 Festival Flower Dance - spring24.xnb",
			"Action":"EditData",
			"Target":"Data/Festivals/spring24.xnb",
			"Entries":{
				"Abigail":"Can't we just have a flower dance without the dance? I don't mind the dress.$u",
				"Robin":"A flower feature can really make the aesthetics of your home come together. Have you seen the crafting recipe that Pierre has for sale?",
				"Demetrius":"It makes me so proud to see Maru in this festival. Kids sure do grow up fast.",
				"Maru":"I wonder if my dad's going to be videotaping this?#$b#I guess he can if he wants. He never really goes back and watches old videos, anyway.",
				"Sebastian":"After a while, these festivals get... routine.#$e#I think I'm just numb to this one, at this point.",
				"Linus":"I wondered if it would be a good idea for me to show up this year.#$b#Well, thank you for visiting with me.$h",
				"Caroline":"Abby needs to learn that a little dance once a year is far from anything that will kill her.#$e#I think she's more insecure than she realizes, and there's only one way to fix that!",
				"Alex":"Dancing's really fun if you've got the right partner!$h",
				"George":"My body'll be screamin' at me tomorrow for pushing myself all the way out here.#$e#It's the least I can do, though.",
				"Evelyn":"George won't let me push him out here to the clearing. Says he still wants to do it himself.",
				"Clint":"*sigh*$s#$e#...What? Oh, I wonder if I should see who's over by the river.",
				"Penny":"Okay. I just have to breathe. And not think about who's watching.",
				"Pam":"Heh heh. Mayor Lewis can't help but keep an open wine bar at this event. It's tradition, after all!$h",
				"Emily":"It's good to see Haley in a purely positive mood. I do my best to help make this day special for her.",
				"Haley":"La da da, la da da, la da da DA...#$b#...nailed it. Okay. I think I'm ready.",
				"Jodi":"I can't wait to see Sam dance again. He never does stuff like this at home.$h",
				"Marlon":"Gil told me he used to go to this festival, long ago.#$e#Apparently, it's been about thirty years. Maybe longer. He said he lost count.",
				"Sam":"You just can't be afraid to have some fun, you know?$h",
				"Leah":"Hey @. Don't mind us. Elliott and I were just debating aesthetics again.",
				"Shane":"Hmm... good thing I'm not too big into wine. It's tempting, though.$u",
				"Marnie":"Hey @. D'you think if I just went over and...$s#$b#...Er, never mind.$s",
				"Elliott":"The true beauty of flowers comes from their very temporary nature, not just their physical appearance.#$b#The shorter something lasts, the more precious it can potentially be.$h",
				"Gus":"Well, everybody seems to be having a good time. Looks like another success.",
				"Harvey":"I wonder how many of my old colleagues would be willing to dance at an event like this?$h",
				"Jas":"I wanna see Ms. Penny's flower dress!$h",
				"Vincent":"If you dance with someone, it doesn't mean you have to promise to marry them, right?$u",
				"Willy":"Hmm... what is there for someone like me to do at a festival like this?#$e#I think I'll stay until the dance wraps up. It's only polite.",
				"Kent":"Dancing with everyone watching... Sam's got some kind of guts it seems I never had.#$e#Hey, I'm proud of him.",
				"Leo":"Mmm, I like all these colors.",
				"Abigail_y2": "Here we go again.$3#$e#Guess I'll live through this one, too.",
				"Robin_y2": "Some of my out-of-town friends can barely believe we still have traditions like this in the valley.#$b#For me, though, it's exactly why I love living here.",
				"Demetrius_y2": "The timing of this festival is in almost perfect congruence with a swell in the ecosystem's activity.#$e#I'm sure that's no coincidence. Humans are connected to the natural world more than we realize.",
				"Maru_y2": "*giggle* It's fun to be unapologetically girly every once in a while.$1",
				"Sebastian_y2": "It's gotta be some kind of herd mentality that keeps me coming back here against my will.#$b#I guess there are... some individuals... who shouldn't have to suffer on their own.",
				"Linus_y2": "A lot of death and decay goes into nourishing all of these flowers.#$b#Er, sorry... I don't mean to be gloomy. I simply mean that from different perspective, it's actually just as beautiful.#$e#Give it some thought.$1",
				"Caroline_y2": "Has Pierre even sold anything today...?",
				"Alex_y2": "Okay, I'm ready for some dancing. Bring it on!",
				"George_y2": "I wonder how many more of these festivals I've got left in me...?#$e#Oh, don't worry. I don't plan on quitting any time soon.",
				"Evelyn_y2": "I hope you like the flower arrangements, dear. I put in a little extra effort every year.",
				"Clint_y2": "Emily's a pretty good dancer, you know.#$e#I hope the men she dances with appreciate that.",
				"Penny_y2": "I know the dance'll be fine. It always is. But my nerves can never seem to settle down.",
				"Pam_y2": "How's Penny doin'? That girl sure knows how to worry herself.#$e#I'm sure she'll be fine.",
				"Emily_y2": "I remember your first year at the flower dance. That was a good year!",
				"Haley_y2": "One of these years, I know I won't be the flower queen anymore. But for now, no one seems to have a problem with it.",
				"Jodi_y2": "I wonder how many more years until Vincent's old enough for this?",
				"Kent_y2": "Dancing... singing... all just for the heck of it.#$b#This is what happiness looks like.#$e#I'm grateful to see everyone happy like this. It's... what it's all about, right?",
				"Marlon_y2": "Such a contrast to my usual environment. *sigh*#$b#Perhaps I should have put more effort into matters of love when I was younger.",
				"Sam_y2": "Hey, I don't care who knows that I like flowers. Anyone who's comfortable in his masculinity has to be honest.",
				"Leah_y2": "I love the waterfall we passed on our way in here. Now, how can I paint it in a way that evokes that exact sound?",
				"Shane_y2": "Nobody seems to mind if I sorta half-ass it through the dancing.$u#$b#Hope you're not offended, or anything...$3",
				"Marnie_y2": "Everyone looks so lovely! I can't decide whether this festival makes me feel older or younger. Or maybe a bit of both.",
				"Elliott_y2": "I'm feeling particularly inspired by this scene. I should dig up some of my old sonnets and see if they need any revision.",
				"Gus_y2": "Looks like the weather turned out perfect again for a picnic.#$b#That's definitely a good thing, 'cause I most certainly do not have a backup plan if it rains.$1",
				"Harvey_y2": "This dance is supposed to be for young people.#$b#I... guess that means I can still participate.$11",
				"Jas_y2": "Granny Evelyn let me help out with some of the flowers this year!",
				"Vincent_y2": "I wanna collect one of each color of the flowers here. You gotta be quick, though, when no one's watching.",
				"Willy_y2": "Dorados should be lurking in these rivers pretty soon. They're one o' the rarer catches here in the valley.",
				"Leo_y2": "It feels like this clearing is in a whole different world."
			}
		},
		{
			"LogName":"Year 3 Festival Luau - summer11.xnb",
			"Action":"EditData",
			"Target":"Data/Festivals/summer11.xnb",
			"Entries":{
				"Governor":"Ah yes, the natural beauty here is lovely, Lewis, but campaigning for Stardew Valley as a tourist destination remains to be decided.#$e#Do tell me about the annual fall fair. Can we expect it to be filled with delicious cuisine?",
				"Abigail":"Hey, I think I saw a whale spouting on the horizon.#$e#Wait! There it is again!$h",
				"Robin":"Emily's fine. She does that all the time in aerobics class.",
				"Demetrius":"Are you sure Emily is okay, honey? She started dancing long before we did.",
				"Maru":"Mmm, I'm saving room for Linus's roast. Looks like it's just about done.",
				"Sebastian":"If the soup turns out terrible, I'm sure Sam's going to challenge me to a contest to see who can eat the most.#$e#He'll win.$h",
				"Linus":"Ah, good morning, @! Would you like a piece of breakfast?$h#$e#Oh, right. We're past breakfast time. I must have slept in later than I realized.",
				"Pierre":"I got done speaking with the Governor right before you arrived.$h#$e#It went... fine.#$e#He didn't actually respond to me.$s",
				"Caroline":"I worked everyone just a bit harder during aerobics this week. We've all earned a little feasting, I'd say.",
				"Alex":"Now this is what I'm talking about! Why don't we just do this kind of party every day?$h#$e#We could make Pelican Town into a beach paradise spot for tourists.$h#$e#Hey, maybe I should be mayor someday.",
				"George":"I liked the luau better, back when we didn't have those big electronic speakers ruining the atmosphere of the beach.#$e#This was... oh, twenty, twenty-five years ago.",
				"Evelyn":"This is just about the spot where I'd build sandcastles as a little girl, all these years ago. I can still picture it.#$e#Oh, this was well before I lived in Pelican Town. My family used to come here on vacation.$h",
				"Lewis":"Ah! Governor, do you remember? This is @, one of our premier agriculturalists here in the valley.$h#$b#Psst... Hey @, we're really counting on you this year, okay?",
				"Clint":"Welp, time for another helping.",
				"Penny":"I have to admit it's a bit fun to watch Mayor Lewis's different facial expressions throughout the day.$h#$e#I hope his conversation with the governor goes well.",
				"Pam":"Marnie better be watching that soup carefully. I'm countin' on taking home some leftovers for tomorrow's lunch.",
				"Haley":"*giggle* My sister is such a dork sometimes.",
				"Jodi":"Kent and I are sharing these little dumplings. They're beyond delicious.$h#$e#I wish Gus would share his recipes more often.",
				"Marlon":"This festival is especially uplifting, after spending so much time underground and in the dark.",
				"Sam":"Alright, Penny, alright. The anchovies thing was just one year. I promise I won't put anything gross in the soup.#$b#*psst* You, on the other hand, @...$h",
				"Leah":"Aren't the first local melons of the season about to come in? Ooh, that sounds so delicious right now.",
				"Shane":"Hoo... I'm getting a little overheated here from all this spicy food. What is there to drink?",
				"Marnie":"I just love seeing everyone together like this.",
				"Elliott":"There's a marvelous lobster bisque on the table closest to the ocean. Have you had some yet?$h",
				"Gus":"I could make a delicious soup, no problem, but the potluck soup is supposed to be more a reflection of the whole valley, not a reflection of me.#$e#I just have to step back and let it be what it'll be!",
				"Wizard":"Ever notice how it's always sunny on festival days?#$e#Yeah, you're welcome for that.",
				"Harvey":"Is Emily still dancing? Good grief. I told her, dehydration and dance meditation are not the same thing.$11",
				"Jas":"Nobody needs a squirt gun to dance, Vincent.",
				"Vincent":"You should get a squirt gun and shoot it at my feet, like a cowboy! Then I'll dance like, woo-woo-woo!",
				"Willy":"I hope everyone cleans up better than they did last year. This might as well be my backyard.",
				"Leo":"There are so many different foods! On the island, I mostly ate the same things every day.",
				"Kent":"This is the kind of stuff I dreamed about when I was overseas.$h#$e#It's worth a little reflection.",
				"Governor_y2": "That one year, the soup was delicious! Was that last year, or...?#$b#...no, perhaps it was a different year? Ah, I can't remember.",
				"Abigail_y2": "Mmmm, @, why don't you grab one of those turkey legs and just chow down like a champ?#$b#Like some kind of medieval gladiator, fresh from the fight?#$e#Well fine, if you won't, maybe I will!$1",
				"Robin_y2": "Oh, hi @! It wouldn't be a proper luau without a little dancing, would it?$1",
				"Demetrius_y2": "Honey, what was that dance step you taught me at the saloon the other night?",
				"Maru_y2": "Hey, here's a game. Watch the mayor, and every time he smiles and says 'Absolutely!' to the governor, you get a point.#$e#It's adorable. I've only been sitting here for a few minutes and I'm already at five points.",
				"Sebastian_y2": "If it suddenly rained right now, people would scramble and run away like the rain's made of poison.#$e#Is it bad if the thought of that sight makes me chuckle?$1",
				"Linus_y2": "I'm happy to share my roast with you if you'd like, @. Let no part of the animal go to waste, I say.$1",
				"Pierre_y2": "If we ever get a storm on luau day, we could always host the Governor in my store.#$e#...What? I could make it work.",
				"Emily_y2": "Join in! Don't be shy!",
				"Caroline_y2": "I hope you brought an appetite. If you got just a little bit of everything, you still couldn't fit it all on one plate!",
				"Alex_y2": "It's nice, you know? It really feels like Pelican Town is one big family.$1#$e#I should put in more effort to hang out with the people I don't normally see too much.",
				"George_y2": "Evelyn, do you mind? Even if the sun does its worst on me, how does that matter in the grand scheme?%noturn",
				"Evelyn_y2": "George, you forgot to bring your hat. We're going to need a little sunscreen on your head, too.%noturn",
				"Lewis_y2": "Ha, ha! Absolutely, Governor! It must have been last year when the soup was excellent. Any year, really!$1",
				"Clint_y2": "Let's see... what else haven't I tried yet?",
				"Penny_y2": "This looks like a nice place to sit, doesn't it?#$e#Mmm, pulled pork and those slippery rice noodles. I think those are my favorite together.",
				"Pam_y2": "Aw shoot, I forgot to call in to the bus company for my day off!#$e#Oh well. Is anyone gonna notice?",
				"Haley_y2": "Sipping a drink out of a coconut is the best. Have you ever tried it?",
				"Jodi_y2": "It's nice having a day off from cooking on a day like today.",
				"Kent_y2": "I'll steer clear of the soup. Who knows what could be in there?",
				"Marlon_y2": "Do they make one-eyed sun shades?#$e#I can barely see a thing out here. The sun's way too bright.",
				"Sam_y2": "I don't know if I have it in me anymore to be a prankster. It's been a number of years since I pulled anything.#$e#I've gotta set a good example for Vincent.",
				"Leah_y2": "Hey, have you seen any good pieces of driftwood lying around?#$e#I always wonder how long it stays out at sea before it comes back home.",
				"Shane_y2": "Linus knows what's up with that roast. When the weather's like this, barbecue somehow tastes even better.",
				"Marnie_y2": "*yawn* I'm tired. I think I'll sleep like a log tonight, especially after such a feast.$2",
				"Elliott_y2": "I didn't forget about the luau this year!$1#$e#Well, Leah reminded me, anyway. That helped.",
				"Gus_y2": "Based on what I've seen going into that soup, I'd say a little wine might be safe to add. Or something savory, like cheese or truffles.#$e#It'd have to be the best of the best quality, though.",
				"Wizard_y2": "What? I'm not being antisocial. This is quite social for me, thank you.#$e#Compared to my usual lifestyle, this is...#$b#...look, I'm doing my best, okay?",
				"Harvey_y2": "I trust everyone here enough to take decent care of themselves in this heat.#$b#But it's still my job to nag everyone, anyway.$1",
				"Jas_y2": "I'm helping Aunt Marine!$1#$e#...But she doesn't have anything for me to do right now.$3",
				"Vincent_y2": "Jas doesn't want to dance this year.$3#$e#I've gotten better at dancing since last year! Really!$3",
				"Willy_y2": "It's just past the horizon, down south. If you sail out that far, you can see the Fern Islands from that point.#$b#Wouldn't you say that's about right?",
				"Leo_y2": "The parrots would really enjoy this beach during the summer!$1"
			}
		},
		{
			"LogName":"Year 3 Festival Moonlight Jellies - summer28.xnb",
			"Action":"EditData",
			"Target":"Data/Festivals/summer28.xnb",
			"Entries":{
				"Abigail":"Ahh, my favorite day of summer. And not just because it's over.",
				"Robin":"My first year in town, I saw the old candle-boat they were using, and I said, \"Hey, I can build something like that.\"#$b#So I went ahead and made one, and Lewis liked it.",
				"Demetrius":"In my field of study, it helps now and again simply to pause and truly absorb the beauty of the natural world.#$b#It reminds me that we have so much more to learn about nature. In the grand scheme, we've only just started.",
				"Maru":"This evening is always important to me. I hope you enjoy it as much as I do.",
				"Sebastian":"Once, I saw some sort of green creature with a round head poke up above the water.#$e#It was raining, so it was kind of tough to tell what it was.",
				"Pierre":"The harvest season begins tomorrow. It's tough to believe it's already here. Are you all set?#$e#Erm, sorry. I'd love to chat about tomorrow, but I've got to get date night underway.",
				"Caroline":"Pierre, is it closing time yet? Let's head over to our spot.#$e#Oop... sorry, @. Please take the time you need.",
				"Linus":"It's nice to see everyone being so appreciative toward nature. She provides everything we need, especially beauty.#$e#I'll sneak up when the jellies arrive. Don't worry. I won't miss this for the world.",
				"Alex":"I made some really good memories this summer. My only complaint is that it's all over.$s",
				"George":"Can't see much of anything. I'm counting on those jellies letting me know where they are.#$e#They always do.$1",
				"Evelyn":"What a lovely way for the year's youthful days to end. I couldn't ask for more.#$e#I'm still making lots of plans for the fall, though.",
				"Lewis":"Good evening, @. I saved a spot for you here on the deck.#$b#Let me know when you've settled in for the jellies to visit.",
				"Clint":"Can you believe another year's already half gone?#$e#I can't say the first half turned out how I'd hoped, but it did turn out how I'd expected.#$e#You get used to things after a while.#$e#Anyway, thanks for dropping by.",
				"Emily":"*sigh* This evening is like a long goodbye kiss from the season. Sad but sweet.$u",
				"Penny":"The jellyfish have such a simple existence...#$e#And when I think about things in the grand scheme, so must we, by some relative standard.",
				"Pam":"Fall's coming up. It's a tough time for Penny, so you outghta do something nice for her.#$e#I reckon she'd appreciate that.",
				"Haley":"Oh no! I forgot to bring my camera!$s#$b#Will you go back and get it for me?#$e#Hee hee, just kidding. I've got it right here.$1",
				"Jodi":"Kent, honey, I'm so glad you're with me this year.",
				"Sam":"Hmm, I just got the best idea for an album cover.",
				"Leah":"Summer's an extra special time of year for me. I just need an evening by myself to give it proper closure.",
				"Shane":"I'm going to miss these longer days.",
				"Marnie":"I love animals because I can look directly into their faces. But these little guys don't have any faces.#$e#They're still absolutely breathtaking, though. It must be a different kind of beauty.",
				"Elliott":"'The harbinger of hope sighs out his light#$b#While ancient moonlamps serenade the night.'#$b#Oh, @, that's the last two lines of a poem that's fluttering into my head.#$e#I don't keep a poem if I rhyme 'light' with 'night,' so this one's just for the moment.$1",
				"Gus":"It's nice to take the night off. I don't get many of 'em.",
				"Wizard":"The Lunaloos were going to make a modest showing this year. I managed to pull some strings with the sea's spirit guardians, to fix that.#$e#Please don't make a big fuss about it. I'm hiding back here for a reason.",
				"Harvey":"I just have to get a glimpse of everyone. I spend so much time making sure everyone's body's in working order...#$b#...that it's really a touching moment to see everyone so well and peaceful.",
				"Jas":"I hope I see the rare green jelly like Vincent saw last year.",
				"Vincent":"Jas said there were babies last year. I'm going to look for them this time.",
				"Willy":"This might be my favorite festival. Fishermen around the world would give an arm and a leg just to witness this once.",
				"Leo":"I wonder where else the jellies wander? What other places?",
				"Kent":"I should be able to sleep for a few hours in a row after this.#$e#That's more than I can usually get at one time.",
				"Abigail_y2": "The air smells nice tonight, don't you think? A premonition of fall.",
				"Robin_y2": "Hmm, I wonder if that candle-boat needs a little patching up this year.",
				"Demetrius_y2": "The moonlight jellies' bioluminescent glow helps them survive in the midnight zone of the ocean.#$b#Very few places around the world see such a phenomenon, much less every single year on the same evening.",
				"Maru_y2": "Up by the train tracks, the leaves have started changing color pretty noticeably. You should go see when you get a chance.",
				"Sebastian_y2": "I'll admit, living life in the valley isn't so bad on nights like these.",
				"Pierre_y2": "For me, tonight's about letting go and reflecting on what really matters.#$b#Maybe I left a few things undone at work today, but... it'll all be fine.#$e#Oh, shoot. Did I leave the stove on in the kitchen?$4",
				"Caroline_y2": "Pierre, I'm sure everything's fine, dear.",
				"Linus_y2": "Perhaps if I were a creature who lived in the ocean, my understanding of nature would be entirely different.#$e#Despite the depth of my connection to nature, I have to humble myself and realize it's still so limited on the cosmic scale.",
				"Alex_y2": "Did you make any good memories this summer?",
				"George_y2": "This is a good night. Maybe I'll be a bit extra cranky tomorrow from the loss of sleep, but it'll be worth it.#$b#Worth it for me, anyway. I can't say one way or the other for the people who cross paths with me.",
				"Evelyn_y2": "Shhh, George. I think the jellies will be here any minute.",
				"Lewis_y2": "Watching these creatures drift in and drift out each year... of course it reminds me of your grandfather.#$b#...How strange. To see this evening play out so many times, it's surreal to think we all do the same thing with our own lives.#$e#Even if we fade away, there's still the lingering promise that this beautiful cycle will repeat itself.",
				"Clint_y2": "This evening always stirs up my senses. I can't quite describe it.#$e#It's not quite sadness, but it's more like... hope? In a regretful kind of way?#$b#Man, I don't know...$2",
				"Emily_y2": "As long as I've been alive, I can't remember a single year when the jellies failed to show up.#$e#Clearly, when something's important to mother nature, she knows how to be consistent with it.",
				"Penny_y2": "Jas and Vincent are going to be writing jellyfish poems for school tomorrow.#$b#Maybe I should try to write one, too.#$e#I got the idea from Elliott.",
				"Pam_y2": "Hey kid, I always see you workin' so hard.#$b#Hope you enjoy this nice, calm evenin' while it lasts.",
				"Haley_y2": "Last year's photos turned out okay, but I think I can do better this year.",
				"Jodi_y2": "Every day, I can't help but spend so much time worrying about the littlest things.#$b#Oh, to be a jellyfish and just go with the flow...",
				"Kent_y2": "It's nice. I actually feel at peace tonight.#$e#Got to enjoy it while it lasts.$1",
				"Sam_y2": "I'd just like to part the ocean in half with a big wall of water on either side. I wonder how far I could walk?",
				"Leah_y2": "The life cycle of these jellyfish... it all seems so pointless, and paradoxically, that's a part of why it's beautiful.",
				"Shane_y2": "I'm surprised this festival doesn't get more tourists. Does the mayor have a law that swears us all to secrecy, or something?",
				"Marnie_y2": "I actually feel a bit of a desire to sing something. The atmosphere just feels right.#$e#Maybe I'll just hum. I don't want to disturb anyone.",
				"Elliott_y2": "I've prepared a poem for this evening. It's a bit long, but speak to me again if you'd like to hear it.#$e#The Midnight Ocean#$b#When lost in life as though I were asleep, / I fell into the midnight ocean deep, / The tossing waves attacking me to keep.#$b#\"Prepost'rous, I can't die,\" thought I with pride, / For though it swept my body side to side, / \"I only need a luminescent guide.\"#$b#Perhaps a cracking lightning bolt could blind, / Flash up a shoreline, etch into my mind / A simple haven, quite an easy find.#$b#Perhaps a royal galleon, blazing hope -- / The crew would spy me through a telescope, / And with some brilliant fanfare, offer rope.#$b#But nothing regal answered my proud cry: / Instead, some glowing jellyfish came nigh, / These eerie blooms no brighter than a sigh.#$b#And beckoned by this ghostly company, / I joined their flow, my strength returning free, / For drawn along to refuge, I did see#$b#The saving light strikes not in gaudy show / But rather glints in softest somber glow.#$e#Have a good night.$1",
				"Elliott_spouse_y2": "The Midnight Ocean#$b#When lost in life as though I were asleep, / I fell into the midnight ocean deep, / The tossing waves attacking me to keep.#$b#\"Prepost'rous, I can't die,\" thought I with pride, / For though it swept my body side to side, / \"I only need a luminescent guide.\"#$b#Perhaps a cracking lightning bolt could blind, / Flash up a shoreline, etch into my mind / A simple haven, quite an easy find.#$b#Perhaps a royal galleon, blazing hope -- / The crew would spy me through a telescope, / And with some brilliant fanfare, offer rope.#$b#But nothing regal answered my proud cry: / Instead, some glowing jellyfish came nigh, / These eerie blooms no brighter than a sigh.#$b#And beckoned by this ghostly company, / I joined their flow, my strength returning free, / For drawn along to refuge, I did see#$b#The saving light strikes not in gaudy show / But rather glints in softest somber glow.#$b#...#$b#Thank you for indulging me, darling.$1",
				"Gus_y2": "Thankfully, business was a little slow, so I got all the mugs and dishes cleaned early.#$e#It's nice to have the better part of the evening off. That doesn't happen much.",
				"Wizard_y2": "How did you find me back here? I thought I was well-hidden.#$b#Perhaps you are blessed with the gift of clairvoyance.#$b#Oh wait. No, you probably just remember me being here last year.",
				"Harvey_y2": "I've been looking forward to this night for the past couple of weeks.#$e#What makes this evening special for you, @?",
				"Jas_y2": "I wonder if this year's jellies are the same as last year's.#$b#'Cause if they are, the babies are probably all grown up now.",
				"Vincent_y2": "I'm not tired! I never get tired!",
				"Willy_y2": "As tempting as it is to go get my net and scoop one of these up, it's not my place to do such a thing.#$e#That would be disrespectful to the ocean.",
				"Leo_y2": "This evening... it feels like I'm getting a big hug from the whole world.#$e#It's... chilly, isn't it? And somehow... cozy, too.",
			}
		},
		{
			"LogName":"Year 3 Festival SDV Fair - fall16.xnb",
			"Action":"EditData",
			"Target":"Data/Festivals/fall16.xnb",
			"Entries":{
				"Abigail":"I wish we had a 'Tent of Horrors' or something like that, as a place to spend star tokens.",
				"Robin":"It's been good catching up with Leah! We don't normally run into each other a lot, but we've got a lot in common.$h",
				"Demetrius":"I've thought about doing a grange display, but if it were truly a representation of my best work...#$b#...you'd have to look at it under a microscope.#$e#So... that's a bit of a problem.$h",
				"Maru":"I came back for the barbecue sandwiches, but maybe I'll have a burger this year.$h",
				"Sebastian":"Just serving my time here. If I'm after fun, I've got dozens of games at home that I'm more invested in.$u",
				"Pierre":"Oh, hey @. Uhh... did one of my pumpkins actually come from your farm?",
				"Caroline":"Pierre feels like the success of the store depends on his grange display. I tell him not to worry so much.#$e#We sell the products of everyone who's entered here, including you. So it doesn't make a big difference in the long run.",
				"Linus":"These animals have gentle souls. They deserve the best.$h",
				"Alex":"I'm saving up for that fedora, but it's taking a while with just the 'Strength' game alone.$s",
				"George":"I won't say no to a good-quality meal. At least with this festival, I don't have to travel far to reach the food.#$e#And at least there's something besides eggs.",
				"Evelyn":"George, we need to make sure we're watching your cholesterol.#$e#If you don't eat it, I won't either.",
				"Lewis":"@! Welcome! Can we expect a grange display from you this year?$h#$b#I called in mostly the same entertainers and vendors as last year. But if it ain't broke, don't fix it!$h",
				"Clint":"I know you're familiar with my work on your own tools, but if you want a little more reassurance, take a close look at these.$h#$e#Marlon sells my weapons at his guild, in case I haven't told you.",
				"Emily":"It's cute how Haley gets so invested in the fortune teller. I think I can claim credit for that one.#$e#Well, we can all use a little something to look forward to.",
				"Penny":"Last year, I made off like a bandit at the wheel of chance.#$b#I've been unable to recreate my success, so I'm trying to figure out if orange or green wins more often.",
				"Pam":"I'm taking a break before I go back in there and whup that fishing game again.$h#$e#It's definitely the best place to earn star tokens.",
				"Haley":"Everything the fortune teller told me last year came true. She's amazing.#$e#I hope my fortune comes true this year, too!$h",
				"Jodi":"Excuse me, uh... Mr. Clown? Do you tell a joke if we give you a tip? Is that how this works now?$s",
				"Sam":"I got a 4x multiplier at the slingshot game for having perfect accuracy! The star token payout was insane!$h",
				"Leah":"Hanging out at Robin's display is like getting a free woodworking class.$h#$e#Sometimes I miss being a student.",
				"Shane":"Marnie put me in charge of the petting zoo. Go ahead. Give 'em a pet.#$e#Hey, if you wanna take one home, you know the system: ask Marnie.",
				"Marnie":"If only the displays were based on taste, rather than looks. Then maybe I'd have a fighting chance in the competition.",
				"Elliott":"It's a marvelous view of the fairgrounds up here, isn't it?$h",
				"Gus":"Goodness! Some folks really like to slather on that barbecue sauce!$h#$e#I take pride in my secret sauce, but make sure you can still taste what's under it!$h",
				"Wizard":"I refrain from telling my acquaintances about their futures, for fear of the consequences. Welwick is different.#$b#She is uniquely gifted and will tell you exactly what you need to know.",
				"Harvey":"If human medicine had been too much for me, I suppose I could have easily wound up working as a veterinarian.#$b#The work's still quite rewarding, I'm sure.",
				"Jas":"Do you like our animals?",
				"Vincent":"I wanna ride one.#$e#Will you lift me over the fence?#$e#Aw, c'mon!#$e#...Where's Sam?",
				"Marlon":"I wonder if I could get my investment back if I purchased one or two of these blades for the guild's stock?",
				"Willy":"I'm most proud of that Dorado. Have you caught one of 'em before?#$e#It's hard to put together a good grange display when a beautiful fish's shelf life is so short.",
				"Kent":"...Why?#$e#Just why...?",
				"Leo":"There are so many people here today. And in the city... it's even more crowded?$3#$b#Whew.$3",
				"Abigail_y2": "I got my fill of the games here over the past few years.#$b#Oh well. There are still lots of interesting things to see. Check out that mace. Think you could heft it?",
				"Robin_y2": "I'm here to see if I can inspire anyone to pick up some materials and craft something that they wouldn't have otherwise.#$e#Leah's already got quite a bit of skill, but I'm helping her with the mathematical side of the craft.",
				"Demetrius_y2": "These sheep have evolved to produce exponentially more wool than their wild ancestors.#$b#If you let one of these creatures out into the wild, they grow into big shaggy puff-balls.$1#$b#A little funny, but a little pitiful, too.",
				"Maru_y2": "This is a good area for some people-watching. I sometimes forget how exotic it is to see people who don't live here.",
				"Sebastian_y2": "So much noise. Maybe I'll take my bike out for a ride later to unwind.",
				"Pierre_y2": "Hi @. I was wondering, do you really need the star tokens for winning first place this year?#$e#I mean, don't let me deter you, I just...$4",
				"Caroline_y2": "I really wish I could just retreat into my sunroom right now.$2#$e#But... I can't even get inside our house with these grange displays in the way.$2",
				"Linus_y2": "I already got a good meal from Gus at the other end of the fair.#$b#I came over here to pay my respects to these selfless creatures.",
				"Alex_y2": "I think I'll stay away from the strength game this year. What other games do they even have here, anyway?",
				"George_y2": "Hrmm... They just don't have clowns like they used to. Where's the spirit?#$e#Anyone have a pie? Clowns love getting pied in the face.#$e#Real clowns love it, anyway.",
				"Evelyn_y2": "Oh, George, behave yourself.%noturn#$e#The day is lovely, don't you think, @?",
				"Lewis_y2": "Hello there, @! I suppose you know the drill by now.#$b#I'd love to see what you've brought this year.$1",
				"Clint_y2": "Unfortunately, I don't have any iridium bars for display. That stuff's too valuable not to use.",
				"Emily_y2": "Maybe Haley would like it if I got her a balloon? You're never too old for balloons.#$e#Whoever's tired of balloons is tired of life.$1",
				"Penny_y2": "Back when I won the wheel of chance ten times in a row, I guess it amounted to a 1 in 1024 chance.$2#$e#But that's assuming the orange and green sides both come up evenly.",
				"Pam_y2": "I can never seem to get my fishing hobby off the ground, 'cept at festivals.#$e#Maybe if I was younger again...",
				"Haley_y2": "The fortune teller? I dunno. I forgot my fortune from last year. I'm kind of over it.#$e#I still do it for fun, but I want to live for what I want, not just for what someone said might happen to me.",
				"Jodi_y2": "Did they set up the fortune-telling tent right on top of those gravestones?#$b#That uh... hmm. I don't know how to feel about that.$2",
				"Kent_y2": "I'm not sure Sam and Vincent need much coaching from me in the slingshot game. But Vincent's so eager to learn.$1",
				"Sam_y2": "They just gave me a big ol' bag of tokens after I won the slingshot game.$1#$e#Now... double or nothin' at the wheel...",
				"Leah_y2": "I thought about opening my own display at the fair.#$b#It could be fun, but then I wouldn't get a chance to enjoy the rest of the fair as much..",
				"Shane_y2": "These cows are responsible for the giant cheese wheel Marnie's got on her display. And these are two of our best chickens.#$e#The pigs and rabbits just needed a day out.",
				"Marnie_y2": "Is there anything I can do to make my display more visually appealing?",
				"Elliott_y2": "Gus's barbecue is always a symphony of flavor.$1#$b#Now that I'm properly energized, it's time for another round of fishing!",
				"Gus_y2": "It takes some practice to manage four grills at once, but once you get a system down, it works out fine.",
				"Wizard_y2": "...#$e#...Hmph.#$e#I've been banned from the 'Strength' game for using my telekinetic powers on it.#$e#There was no rule against it. This is preposterous.",
				"Harvey_y2": "That barbecue smell drifting over here sure is nice, huh?#$e#I'll bet it's a similar smell as from thousands of years ago, when people got together and started human civilization as we've known it ever since.",
				"Jas_y2": "The brown cows are Ruby and Riley, and the white cows are Brindall and Bailey.#$b#That's what I named them, anyway.#$e#Sometimes they steal each other's food and they huff at each other. But most of the time they're best friends.",
				"Vincent_y2": "The slingshot game is where it's okay to do things that would normally get me punished!",
				"Marlon_y2": "I'd like to see a demonstration of those swords' durability before I buy any from Clint.",
				"Willy_y2": "I had just about the biggest catfish you've ever seen, early in the season.#$e#Too bad it didn't last until today.#$e#Well, a man's got to eat...$2",
				"Leo_y2": "When the grange displays are all done, I wonder if anyone will throw them in the trash.#$e#Uncle Linus says we can take anything we want from there.",
				"Sandy_y2": "Heehee! ~ Now this is the entertainment I came here to see!$1"
			}
		},
		{
			"LogName":"Year 3 Festival Spirits Eve - fall27.xnb",
			"Action":"EditData",
			"Target":"Data/Festivals/fall27.xnb",
			"Entries":{
				"Abigail":"What do you mean about the spiders not being real? They definitely move when I poke my head around the corner.$s",
				"Robin":"What are you planning to do in your upcoming off-season?",
				"Demetrius":"This festival is fun, but I feel like sometimes people can take their own ideas of fun a little too far.",
				"Maru":"What I need is some kind of device that can track my location and steps.$s",
				"Sebastian":"Nice. They've got the skeletons again.$h#$e#It's pretty tricky for Marlon to get 'em here, so I wasn't sure if they'd have 'em.",
				"Caroline":"Um, if you see Abby in the maze, can you tell her not to miss dinner? They've got some of her favorites here.",
				"Alex":"I brought my bat just in case something jumps out at me.#$b#Remember, it's always the sports star who saves the day in the horror movies... right?",
				"Lewis":"This is a pretty hands-off festival for me. Somehow, it comes together each year, but I'm not entirely sure how.",
				"Clint":"I'm reasonably aware... if it's Marlon who's brought these monsters, they're probably the real deal.",
				"Emily":"What an exciting night! The square is buzzing with activity from spirits we can't see.",
				"Penny":"Is someone playing tricks on me? How did I wind up here?$u#$e#This cauldron... It's... familiar.$s",
				"Pam":"Was it just me, or did I hear a scream come from the direction of the maze?",
				"Haley":"I got a little ways in, and then in the shadows I saw something moving out of the ground.$s#$b#...I think I'm done.$s",
				"Jodi":"I'm sure Vincent only wants to go into the maze because Sam makes it seem like no big deal.$4#$e#I don't think he realizes what he'd be getting into.",
				"Sam":"I swear I've seen this layout to the maze before...$s#$b#But for some reason, my memory gets... unnaturally fuzzy when I try to remember previous years.$s",
				"Leah":"Surreal horror art suddenly sounds appealing. Been a while since I made anything like that.#$e#When you live alone and you spend too much time with your mind steeped in that genre, though, it can mess with you a bit.#$b#Hmm, maybe I'll pass.$s",
				"Marnie":"I'm glad this event isn't held close to our farms. The animals would go into a panic.",
				"Elliott":"Soon, the world will fall inevitably into a deep, deathly sleep.#$b#But just as inevitable is the struggle to stay awake just a little longer, in nature and within ourselves.$h",
				"Gus":"Everyone needs a slice of pumpkin pie this year! I insist!$h",
				"Harvey":"An open-heart surgery never bothered me, but this... It's just the type of creepiness that gets to me.$s",
				"Shane":"So what's this about an underground frozen fortress? The adventurer guy was saying something about it.",
				"Jas":"Aunt Marnie, I know there's no such thing as monsters and ghosts. Why can't I go in?",
				"Vincent":"I got to go into the maze last year. Why not this year$s",
				"Marlon":"To slay a skeleton is one matter, but to capture one is a different feat altogether.",
				"Leo":"...$3#$b#...This movie...$3#$b#...$3#$b#...is baaaaad.$3",
				"Kent":"Must have taken a lot of effort to get this whole event set up.",
				"Abigail_y2": "These wilderness golems don't look so tough...#$e#The mummies, on the other hand...$9",
				"Robin_y2": "The structural integrity of those monster cages looks pretty good...#$b#...I think.$6#$e#Maybe I should take a closer look when I'm done with dinner.$2",
				"Demetrius_y2": "Sebastian finished his dinner a while ago. I wonder how long he's going to be in that maze?",
				"Maru_y2": "No mazes for me this year, thanks.#$b#Not after some of the stories I've heard.$2",
				"Sebastian_y2": "Don't mind the wiggly hands. If one of 'em grabs you, just kick 'em off.#$b#But not too hard or violent. You've gotta be assertive, but polite.",
				"Caroline_y2": "There goes Abby, running off again...$2#$e#Maybe you'd like to finish her crab cakes?",
				"Alex_y2": "I made it to the end last year, but all I found was an empty box. Someone must've beaten me to it.#$e#*sigh* Where oh where should I go next?",
				"Lewis_y2": "I can't decide whether I love this festival or hate it.#$e#It's definitely impressive, but I can't ever seem to find answers for how that old man puts it together and cleans it up.",
				"Clint_y2": "Nahh, the monsters over there don't scare me. If Marlon says it's safe, it's safe.",
				"Emily_y2": "May we all find safe passage through this maze.$7",
				"Penny_y2": "I hope the kids are okay in there. They're with adults, but I wonder if it's all a bit much for them.",
				"Pam_y2": "You wanna know somethin' scary? *hic* We all get old and wrinkly one day. Just look at me! Hah!$1#$e#You ready to take your turn one day? I used to be skinny an' pretty just like Penny!$1",
				"Haley_y2": "My camera keeps malfunctioning. What's going on?$12",
				"Jodi_y2": "I let Vincent go into the maze. He seemed completely unfazed.$2",
				"Kent_y2": "I used to love stuff like this when I was a kid. These days, though, it seems like...#$b#...I dunno, just a waste of adrenaline, if that makes sense.",
				"Sam_y2": "Heh, heh, heh...$11#$b#...$7#$b#...Hah! Scared you, didn't I?$3#$b#...$7#$b#Err, actually, in all seriousness, what just happened? How did I get here?$2",
				"Leah_y2": "Eek!$6#$b#Oh, it's just you. Sorry, I'm a bit jumpy.$3",
				"Marnie_y2": "Whew, done for the day. Time to relax a little. ...Relatively speaking.",
				"Elliott_y2": "I read some classic horror stories earlier today. Such fun!#$e#I wonder how these creatures might respond to a read-aloud of the creepy tales.",
				"Gus_y2": "You can't grow any crops outside soon, huh? Well, I'll be lookin' forward to the spring, then. Local produce can't be beat.",
				"Harvey_y2": "I don't have quite enough energy for socializing, so I came here.#$e#I knew there weren't any jump scares in this part of the maze.#$e#Guess I'll rejoin the living in a few minutes. Heh.",
				"Shane_y2": "Jas, it's already past your bedtime. If we start now, I don't want you falling asleep on me.%noturn",
				"Jas_y2": "Hehe, I love staying up late!$1",
				"Vincent_y2": "I'm not lost. Sam's right around the corner.",
				"Marlon_y2": "You've come a long way, @. Sights like these probably don't even bother you anymore, huh?",
				"Leo_y2": "I snuck all the way through the volcano once. I think I can sneak through here.",
				"George_y2":"Evelyn and I slept through this one last year. Or tried to, at least, what with all the racket.",
				"Evelyn_y2":"*yawn* Ohhh, I'm pretty sleepy.$2#$e#At least it's a short walk home.",
				"Pierre_y2":"Good evening. I have many... mysterious items for sale tonight! ...Heh heh heh.$1#$e#Uhh, actually, I have no idea where some of these things came from.$4",
				"Willy_y2":"$y 'Care to hear the story of the Ghost Pirate Silverhook?_Yes_Over a hundred years ago, Captain Arthur was but a simple captain, sailin' the seas with his crew. One day, a shark pale as the full moon itself, with fiery eyes, attacked the good captain in his skiff and bit his hand clean off. From that day, the captain changed. He replaced his hand with a silver hook and swore vengeance on the shark, searching the seas relentlessly until his whole crew perished. Some say the captain's ship still shows itself when the full moon shines high, forever searching... for his revenge._No thanks_Suit yourself.'",
			}
		},
		{
			"LogName":"Year 3 Festival Ice Festival - winter8.xnb",
			"Action":"EditData",
			"Target":"Data/Festivals/winter8.xnb",
			"Entries":{
				"Abigail":"I think next, I'll try to eviscerate this snow goon's belly with some kind of creature crawling out.#$b#Maybe I can use a few fish from the competition. Ew!$h",
				"Robin":"This should be ready in an hour or two. I hope there are some people who are still around to see it then.",
				"Demetrius":"Can you believe how borderline tropical it'll be around here, in just half a year?",
				"Maru":"Sebastian makes some pretty cool snowmen. I feel like I could learn a thing or two from him, if he'd let me.",
				"Sebastian":"Nah, this isn't too cold. Cold is when you go outside with wet hair and it freezes.",
				"Pierre":"Finally! I can spend some time outside and throw a snowball!$h#$e#Hmm... is there anyone I can hit? Or... they'll just be mad, won't they?$s",
				"Shane":"Two words: Pizza. Festival. Seriously, that needs to happen this year.#$e#It'd be so easy, too. We'd just order a crap-ton of pizzas from Gus and pass 'em around.",
				"Caroline":"I actually think Abby's snow goon is pretty funny.$h",
				"Linus":"I traveled all over the place when I was younger. Some places are like this year round.#$e#I don't think I could handle living on the tundra anymore. That was when I was younger.",
				"Alex":"Heyyy, I've got an idea. Maybe we could take some sports jerseys and have the snowmen wear them.#$e#Actually, would a jersey even fit on a snowman's body?#$b#Ohhh, they'd make my favorite athletes look all fat.$s",
				"George":"I brought my extra-heavy blanket for this.",
				"Evelyn":"My joints will be stiff from spending so much time in the cold, but the visit is worth it.#$e#This festival is very important to me, you know.",
				"Lewis":"Hi there, @! Glad you could make it. Be sure to say hi to everyone.$h",
				"Clint":"Well, look at this, Emily! It's like this snowman's our own little kid! You're the mom and I'm the dad! Heh heh.$h",
				"Emily":"Oh, yeah Clint. Um, I guess?$u#$e#Maybe I can be this snowman's aunt.",
				"Penny":"$y 'Hmm... What kind of snowman should we make?_How 'bout something with peppermint candies for eyes?_Ooh, fun! Do you know anyone who has some candies?_Look to Abigail for inspiration._Oh, yeah. Never mind.$s_Make a conventional one. It's the only true way to do it._When you only do it once or twice a year, the classic ones never get old, huh?'",
				"Pam":"I actually practiced a little bit in preparation for the competition.$h#$e#Er, well, what I mean by that is... I didn't practice. At all.$s#$e#Does the fishing tent from the fair last month count?",
				"Haley":"I should look through my wardrobe for some winter fashions. I've got some really cute fur coats that I've never even worn.",
				"Jodi":"I love the forest when it's silent. When the snow falls off the branches, it makes that soft thump.#$b#I just love that.$h",
				"Sam":"We live right across the street from a river. I'm amazed that I still don't know how to fish.#$e#Oh yeah, I guess I'd get bored pretty quickly, wouldn't I?",
				"Leah":"I got here extra early this morning so I could get started on my sculpture right away. What do you think?",
				"Marnie":"Mmm. Tonight'll be nice, sitting by a fire, with hot chocolate, snuggling up next to...#$b#...um, I mean, just feeling snuggly.$s#$e#So what's new?",
				"Elliott":"Willy taught me some fishing tricks a while back. I wonder if he'll be watching me to see if I remembered?#$e#Don't want to let him down.",
				"Gus":"...What? Sorry. Just daydreaming. I'm already crafting my plans for the Feast of the Winter Star.",
				"Wizard":"Sneaking off to visit my weird tower? You're odd for a mundane.",
				"Harvey":"Well, no one had hypothermia last year, so I guess I can lighten up a bit.$h",
				"Jas":"Ms. Penny, do you have a hat we can use?",
				"Vincent":"Look! If you stomp really hard, little cracks appear in the ice.#$e#What? Why is that bad?$u#$e#Oh...$u",
				"Leo":"When the snow falls from the sky, I like to look straight up and spin around.$1#$e#You should try it.",
				"Kent":"Biggest fish I ever caught was almost as long as my arm... but I suppose you've caught even bigger ones.$h",
				"Abigail_y2": "I think it's safe to say that I'm morally incapable of creating normal looking snowmen.#$e#Oh, I wear that as a badge of honor. But I'll spare everyone else the spectacle this year.",
				"Robin_y2": "I know I'm late getting this done again, but it has to be architecturally accurate!",
				"Demetrius_y2": "It may look like the landscape is inert, but underneath the snow are seeds and sprouts that'll grow and bare themselves in spring.",
				"Maru_y2": "I can be creative with making gadgets, but my creativity has to serve a function.#$e#So, this snowman is serving his function. He's being a very snowman-y snowman.",
				"Sebastian_y2": "That's a cool pond over there. I should visit this area more often.",
				"Pierre_y2": "Ahh, finally, some free time! I don't even have to run a kiosk at this festival!$1",
				"Shane_y2": "Mmm, pizza...$3#$e#Sorry, just got a really wicked craving.",
				"Caroline_y2": "A mug of hot tea is just perfect when you're outside on a day like this.",
				"Linus_y2": "Yes, you know me. I like to keep my distance.#$e#Still, it's nice to watch everyone else in good spirits.",
				"Alex_y2": "At least there are still a couple of gridball games left this season.",
				"George_y2": "Cold? Sure, I'm cold. But I'm always cold, more or less.#$e#But, yeah, this is pretty cold.$2",
				"Evelyn_y2": "I think Alex did a wonderful job with his snowman, don't you think?$1#$e#I helped a little, but -ooh! My fingers got frosty in an instant.",
				"Lewis_y2": "@! Glad you could make it.$1#$b#I sure have seen a lot of fish teeming under the ice this year. Be sure to look forward to it!",
				"Clint_y2": "I was making a snowman, but... *brrr* ...this is as far as I got. Do you think you can take over for me?#$b#It's that lump of snow on the ground.#$e#Er, no, not that lump of snow. The other one.#$e#Actually, that other lump of snow looks better than mine. Maybe use that one? *sigh*$2",
				"Emily_y2": "This old frosty guy's lookin' pretty good, don't you think?$1#$e#Clint deserves some of the credit. He let us borrow the hat, and that's really what makes his outfit pop.",
				"Penny_y2": "The igloos aren't exactly cozy, but I can see how they're livable.#$e#Do you know who made them for the festival, anyway?",
				"Pam_y2": "Hey kid, maybe you could teach me a thing or two about fishing.#$e#Seems like you got pretty good pretty fast.",
				"Haley_y2": "I've been watching a lot of cheesy romantic comedies on TV. The ones in the winter are always best.",
				"Jodi_y2": "I caught Vincent stomping on the frozen lake last year. He's not doing it again right now, is he?",
				"Kent_y2": "I can fish. I used to fish all the time, but...#$b#...I'd rather not have everyone's eyes on me in a competition.",
				"Sam_y2": "I hope we get a blizzard soon. Nothing compares to the big snow we got when I was Vincent's age.",
				"Leah_y2": "What do you think? Is an art project more beautiful if it lasts a long time or if it disappears quickly?",
				"Marnie_y2": "Mayor Lewis gets all the fish from Willy. Must be a bit strange for Willy to catch the same fish twice.",
				"Elliott_y2": "I don't know how you find time for fishing with all of your farmwork on top of it all.",
				"Gus_y2": "I sure could use a few of the fish from the competition and do a special at the saloon. It'd be great to pick over the best ones.",
				"Harvey_y2": "It's a mystery to me how the people who live in perpetually frigid regions managed to survive for thousands of years.",
				"Jas_y2": "Heeere, fishy fishy!$1",
				"Vincent_y2": "I want to make this snowman ten snowballs high!",
				"Leo_y2": "I hope I travel to many different places when I'm all grown up. Maybe some places even colder than here.#$e#There's just so much to see!$1",
				"Willy_y2":"I like to watch the waters of the stream flow by, along with all o' me thoughts. It sets me spirit right for the competition.",
				"Marlon_y2":"Gil once survived in arctic tundra, fending off skeleton mages for nearly a week straight.#$e#I may be an accomplished adventurer, but my feats are nothing compared to Gil's."
			}
		},
		{
			"LogName":"Year 3 Festival Winter Star - winter25.xnb",
			"Action":"EditData",
			"Target":"Data/Festivals/winter25.xnb",
			"Entries":{
				"Abigail":"Mom, are you okay?$h",
				"Robin":"@, cheers to you, for another great year with you in Pelican Town!$h",
				"Demetrius":"What a great time to be alive!$h",
				"Maru":"Oh good. I told my mom, \"Mom, we have to get a table that has the green stuff at it.\"",
				"Shane":"I was thinking maybe I'd start getting into better shape.#$b#Welp, that's out the window now.",
				"Sebastian":"I have half a dozen things on my mind that need doing.#$e#Well, it's just hobby stuff, but I was in the middle of it before we came down here.",
				"Pierre":"I spent so much time worrying about the store this year, but that all seems so far away right now.#$e#I'm really thankful when the year comes together like this.$h",
				"Caroline":"Pierre... Hellooo over there! You're two drinks behind me!$h",
				"Linus":"There's sure to be some leftovers.#$e#That's where my job comes in.$h",
				"Alex":"I'm on plate number five. Feelin' alive!$h",
				"George":"Bah. It feels like we just did one of these Feasts last week.",
				"Evelyn":"I know there's a lot to eat, dear, but I hope you save room for one of my cookies.",
				"Lewis":"Just when we think the long winter will never end, we all spontaneously break into a joyful celebration. Cheers!$h",
				"Clint":"I should probably call my mom.",
				"Emily":"$y '@! What are you hoping to find under the spirit tree?_A rare gemstone._Oh! I bet you must have the perfect place to display it at home, huh?_Something tasty._Oh yeah! Edible items are tough to go wrong with when you feel like you have everything you need.$h$h_A tea set._Hmm, oddly specific, but who knows? You might get it!'",
				"Penny":"It's so cold out, and yet I don't even feel cold at all.$h",
				"Pam":"Hey, kid. Here's to another year.#$e#I'll look forward to seein' you at that bus stop!",
				"Haley":"My parents used to get the most epic gifts for this.#$e#I hope they're doing well... wherever they are.$u",
				"Jodi":"Here, Kent. Why don't you eat the rest of what's on my plate?",
				"Kent":"Looks like I have quite the appetite today.$h",
				"Sam":"I'm thankful for another year with my dad around.#$e#Sure, it's been... different than what I expected when he was away, but it's still so much better.",
				"Leah":"I can't believe Gus doesn't talk more about the food he spent all week prepping.#$e#Maybe candy canes are just his 	go-to subject when he's exhausted from cooking and his mind breaks down.$u",
				"Marnie":"I hope you can walk home tonight after you're done eating!$h",
				"Elliott":"The beach was especially lonely this morning. I took a quick walk up here and discovered such wonderfully warm company!$h",
				"Harvey":"I couldn't believe this festival during my first year here. Eating out in the cold? But it all somehow works, doesn't it?$h",
				"Jas":"Aunt Marnie, can we eat now?",
				"Vincent":"Preseeeeeents!$h",
				"Marlon":"I spent some time in the lava mines this morning. My body isn't properly adjusted to this chill.",
				"Leo":"On days like these... I know I never want to live alone again.#$e#This time together is joyful!$h",
				"Abigail_y2": "My mom almost never drinks except for this day. She must get it all out of her system at once.",
				"Robin_y2": "We're also coming up on the anniversary of your arrival in Pelican Town, aren't we? And look how far you've come!$1",
				"Demetrius_y2": "Any ideas on who your secret gift-giver might be?",
				"Maru_y2": "Mmm, finally. I've been looking forward to this all month.",
				"Shane_y2": "Days like these always give me something nice to look forward to.",
				"Sebastian_y2": "The food's good. I just don't have much to add to the conversation at our table.",
				"Pierre_y2": "I wanted to bring a plate of turkey over here, but Caroline slapped the plate right out of my hand.$2#$e#Ohhh, don't worry, my dear turkey. I'll be back.",
				"Caroline_y2": "Hot cocoa, spiced cider... Is there any plain water? I don't want to get a nog hangover.$1#$e#Eh. It's probably fine.$1",
				"Linus_y2": "I guess I'm basically a citizen of Pelican Town now.#$b#I don't know that I'd want to be a part of any other community.$1",
				"Alex_y2": "Whoa. At some point, I think I lost my hollow leg metabolism.$2#$b#I've only had four plates of food so far, but I feel like I might already be at my limit.$2#$e#Well, they were big plates.",
				"George_y2": "How is it possible that another year's already gone by since our last Feast?",
				"Evelyn_y2": "Oh, another year with the whole town together! It truly is special.$1",
				"Lewis_y2": "Got plans to get things in order for the new year? It can wait!#$b#As your mayor, I insist on some 	local-government sponsored procrastination!$1",
				"Clint_y2": "I already cleared my plate. Maybe I should quit while I'm ahead.#$e#I put on a few pounds this year. Oh well. Better to eat the stuff you like than to eat twigs and leaves all the time.",
				"Emily_y2": "$y '@! What are you hoping to find under the spirit tree?_A homemade meal._Aww, that'd be special, wouldn't it? A little personal touch._A puppy._Ha, if only, right?$1_A new couch._Um... yeah. Maybe? I don't know how that'd fit in any of these boxes.$3'",
				"Penny_y2": "I can't imagine the Winter Star without our town's traditions.#$e#It just wouldn't be the same without our whole town sitting down like one big family.$1",
				"Pam_y2": "Maybe in the new year I'll take a nice road trip. I could hit up a few sites I ain't visited since I was little.#$e#Oh, y'know. I'd take the bus. No one would notice.#$e#Not if I play my cards right. Heh.$1",
				"Haley_y2": "I think I've got a good idea of who my secret gift-giver is.",
				"Jodi_y2": "I made an offer to Gus, to pitch in and help with some of the food, but he refused.#$e#This really is his pride and honor, isn't it?",
				"Kent_y2": "Hey. Having a good time?#$e#Me? ...Yeah, actually. Thanks for asking.$1",
				"Sam_y2": "It was a good year. I think I'm gonna miss this one.",
				"Leah_y2": "There's magic in the air!$1#$e#For one thing, how does the food not freeze? For another... everything else! It's just a magical time for everyone.",
				"Marnie_y2": "Happy Feasting, @! Glad you were able to make it.$1",
				"Elliott_y2": "I believe there are heaters beneath the tables to keep everyone warm. But... shhh.#$b#I agree, Leah, it's simply magic!%noturn$1",
				"Gus_y2": "We've all been through tough times, but by golly, we all have so much to be grateful for! Cheers!",
				"Harvey_y2": "I propose a toast! To a happily-ever-after for Pelican Town and all of us who live here!$1",
				"Jas_y2": "I wonder if I'll get another princess doll this year?",
				"Vincent_y2": "I wish today was every day.",
				"Marlon_y2": "Happy Feasting. Gil sends his regards.",
				"Leo_y2": "Willy got me a box of colored pencils. It was just what I wanted!$1#$e#I can use them for school. Also, if you hold them out, they make good perches.",
				"Willy_y2":"What do I want out o' life in the next year? Oh, more o' the same, I suppose.#$e#If somethin' different happens, that'll be a nice surprise, but I'm thankful for what I got.$1"
			}
		}
	]
}