{
   // "Introduction": "",
    "Resort_Entering": "What a fascinating place! Who would've guessed a tropical island, right in our own backyard!$1",
    //"Resort_Leaving": "",
    "Resort_Shore": "Hmm, I wonder if there's treasure hidden out there. This would make an excellent hideaway for pirates... don't you think?",
    "Resort_Umbrella": "Ooof, this sun is just a bit too much. You can join me here in the shade, if you like, @.",
    "Resort_Wander": "Now, if you were a pirate, where would you bury your treasure, I wonder?",
    "Resort_Bar": "Ah yes, something pink and fizzy please. And don't skimp on the alcohol, either there, Gus!",
    "Resort": "Seems a little on the kitsch side, don't you think?",
    "dumped_Girls": "I hear you've created quite the scene, @. Oh, I'm not judging! Back in my younger days...#$b#But you don't want to hear about those, do you? How tedious, us old folks with our nostalgia!$1",
    "Mon": "The Scarp's certainly cleaned up well. Back in my days it was all mud and coal dust. Wretched place it was then.#$b#I can see now why Jake moved back here.$1",
    "Tue": "$1 Vivi_EllieBird#Ellie wants me to put a bird in my book. She's given me a portfolio of 'interesting' species. Very single-minded, that girl.$1#$e#The new book's coming along nicely. I'm just exorcising a few plot bunnies. What? They run rampant and breed like mad, you know.$1",
    "Wed": "Have you ever been deeper into the mountains, @?#$e#I used to traipse up there all the time. Oh, with a friend.$4",
    "Thu": "Never thought I'd come back here. Still, this place has a nice view. My Jake's done well for himself.",
    "Fri": "I do miss the cats... yes, and Tess too, I suppose. But sometimes friendships, like romantic relationships, don't work out.$2",
    "Sat": "Have you found the orchard yet, @? It'll have run wild by now. Used to pick cherries there.#$b#Tedious job, I wouldn't recommend it, although it does give you time to think. Mostly about the other things you'd rather be doing, admittedly.",
    "Sun": "If you see Clint, can you try and convince him his old mom isn't a dragon, please?#$b#I'm afraid we had a bit of a falling out... I hope one day he'll forgive me.$2",
    "Mon2": "That blasted macaw... it was Clem's you know. He won it in a card game.#$b#Clem was positively shite at cards, so I've no doubt it was rigged. Probably just wanted rid of the damned thing.$1",
    "Tue2": "Be careful what you say to an author, @. You may read it in a book one day!$1",
    "Fri2": "Small towns are so much fun. I like to watch people and imagine their stories.#$b#I'm not often right, of course. Real people are - generally - far less interesting.$1",
    "Sun2": "One of the advantages to being an author is that no matter where you are, or what you're doing, you can always find a story.",
    "Wed2": "Gosh, Eloise is quite the chatterbox, isn't she? Guess she got that from her mother.$1#$b#Jake was always a quiet kid, nose buried in a book - usually an encyclopedia.#$b#Swear that kid knew more than me and his dad put together.$2",
    "Tue4": "I'd love to head into the mountains again, but this old body isn't as obedient as it used to be.#$b#And it's not likely he'd be up there anyway. Or pleased to see me. So best not.$2#$e#WHo is he? Oh, just a boy I knew once.",
    "spring_Sat6": "Evelyn ran the cutest little flower stall, back in the day.#$b#Sold a lot of posies for me to gift their sweethearts.#$b#Oh, I received my share of them. As did she!$4",
    "Mon8": "I should probably call Tess. We may not have parted on the most amicable of terms but...#$b#...we were friends for thirty years, and that's not something I should relinquish so lightly.",
    "Thu10": "",
    "Fri6": "Clint and Jake were best friends when they were boys. I don't know what got between them.$2#$b#Well I do, but we try not to talk about him...$a#$b#I'd say make sensible choices, @, but that's where I went wrong.$2",
    "summer_1_2": "Summer's my favorite season. Time to shake out the swimwear, don't you agree?",
    "summer_Mon": "They really turned this place into high estate, didn't they? Haha, in my days it was all mud and dust.#$b#You have no idea how much coal dust gets into everything, @.",
    "summer_Tue": "Summer really brings in the bugs. I hope you've stocked up on repellent - the little blighters get everywhere.",
    "summer_Wed": "You know, I heard there were mermaids here once, before the slurry from the mines pushed them away.$2",
    "summer_Thu": "I've always considered myself a cat person, but Princess Midnight... well she's taking her time to warm to me.$2",
    "summer_Thu4": "Princess Midnight and I are coming to an arrangement. Last night she even sat with me for a while.$1",
    "summer_Fri": "My wardrobe? Oh, I can't take credit for that. Tess was - is - quite the designer.$1#$b#Never known anyone quite so skilled at turning thrift shop rags into upscale finery.",
    //"summer_Sat": "",
    //"summer_Sun": "",
    "summer_Wed2": "When's my birthday? Oh, when you get to my age, you stop taking note.",
    "summer_Tue4": "Never piss off an author, @. Hah, I've killed off my critics so many times. Sometimes it's deliciously macabre.$1#$b#Not all those books see print of course.$1",
    "summer_Sat6": "You may have heard that I wrote the Lunarkin books for my kids.#$b#That's just good marketing. I really wrote them for me, and to honor an old friend.#$b#Doubt he ever read them though.$2",
    "summer_Mon8": "I knew Caro's mother. Even babysat for her, a couple of times; she was desperate, and I was broke.$1#$b#Caro was quite the handful. Thank Yoba, her brother was much better behaved. He mostly kept her out of too much mischief.",
    //"summer_Thu10": "",
    //"summer_Fri10": "",
    //"fall_1": "",
    "fall_Mon": "Are you any good with cryptic crosswords, @? They always do my head in.#$b#But I hear it's good to keep the old brain active.",
    //"fall_Tue": "",
    //"fall_Wed": "",
    "fall_Thu": "Tess loves sudoku. Never saw the point in it myself.$3#$b#It's not even maths - it's just fitting symbols into squares. Give me a crossword any day.",
    //"fall_Sat": "",
    //"fall_Sun": "",
    "fall_Wed2": "George was quite the hunk in his day. Too old for me, obviously, but he certainly had a way of catching one's eye.$1",
    "fall_Tue4": "You would've liked Del. That may be trite, but almost everyone loved her.#$b#It's a real shame what happened to her. Cancer's a bitch.$2",
    "fall_Sat6": "Have you met that wild man up in the mountains. I wonder what skeletons are buried in his past...#$b#What? Surely, you'd have to be repenting for something to want to live like that.",
    "fall_Mon8": "Writing ones memoir leads to a lot of self-reflection.#$b#I don't know if I'd recommend it.$2",
    "fall_Thu10": "Have you seen the mysterious man with cyanosis, @?#$b#Don't trust him; He's a meddler and manipulator. I would even believe he were one of the fae. Or possibly a demon.$2",
    "fall_Fri6": "Lewis was always a people pleaser. He hates anyone to think badly of him, for all that he casts an aura of benevolent incompetence.",
    //"fall_Fri10": "",
    //"winter_1": "",
    "winter_Mon": "Chilly morning for a stroll, isn't it? But I've gotta keep these old bones moving.$1",
    "winter_Tue": "Why aren't I working? Well sweetie, I'm always working. Fresh air and birdsong is far better inspiration than staring at blank page.",
    "winter_Wed": "Oh! Hello @. You surprised me!$1#$b#I was working out a tangled plot snarl in my head.",
    "winter_Thu": "Retired? Hah! I could only retire if the characters in my head would shut up.#$b#And I don't see that happening anytime soon.",
    "winter_Fri": "In my courting days, I strolled this scarp with a sweetheart.#$b#We'd tuck wildflowers behind our ears. He looked hilarious, big fellow that he was.$1#$b#I wonder where he is now?$2",
    "winter_Sat": "Seen any interesting birds around, @? If so, be sure to tell Ellie.",
    "winter_Sun": "Have you done much travelling, @? It's been mostly just book tours for me, I'm afraid.$2#$b#Zuzu. Grampleton. I once attended a Writer's Festival in Point Drake. Pretty place.",
    "winter_Wed2": "Are you a reader, @?#$b#If you want to be hooked up with some advance copies, let me know! I'll talk to my publisher.$1",
    "winter_Tue4": "Regrets? Yep, I've had a few. I married too young, and for all the wrong reasons.$2#$b#Word of advice: Don't commit if your head says 'yes' but your heart says 'no', @.",
    "winter_Sat6": "Poor Clint, mooning after Emily like a lovestruck puppy.#$b#He can't even see that she's oblivious to his affection, and would never reciprocate it.$2#$b#Her feelings lie elsewhere.",
    "winter_Thu10": "You know, I'm glad I came back,  @.#$b#For forty-odd years, this place haunted me... and now, it's home again.#$e#Perhaps I'll retire here. What do you think?",
    "winter_Wed6": "Tess rang me last night. Seems she's finally forgiven me.#$b#I'll probably forgive her too... at my age, you shouldn't cling to a grudge for long.$2",
    "winter_Fri10": "Everyone thinks that just because you're old, you must be prudish.#$b#They forget my definitive years were the time of free love and liberation.$1#$b#Oh, the stories that I could tell... but I'd best not.$4",
    "Saloon2": "I come in here every night, and hope my son will talk to me.#$b#Pathetic, aren't I? I mean, I could just go and talk to him.$2",
    "Saloon6":"I tried having a word with Clint earlier... Received a grunt in response.#$b#Well, I suppose that's progress.$2",
    "spring_12_2": "Are you ready for the egg hunt tomorrow? Ellie's coerced me into painting eggs for it.$1",
    "spring_23_2": "Do you have a sweetheart for the dance tomorrow, @?#$b#Hah, one of the advantages of being old is I can get away with asking forward questions.$1#$b#You're under no obligation to answer them, of course.",
    "winter_7_2": "I hear the ice fishing is tomorrow. Pointless endeavor, if you ask me.#$b#Never understood sport fishing. There's no point in catching fish if you're not going to eat them.$2",
    "fall_26_2": "Ellie's clamoring for a scary story before bed tonight. Me? I'm wary of giving her nightmares.",
    "summer_10_2": "Everyone's looking to impress the Governor tomorrow. Pah, what have local governing bodies done for me, that's all I can say?$3#$b#Still, guess I'll have to behave for Jake's sake.",
    "summer_28_2": "Ellie's been lecturing me all day on the biology of the jellies.#$b#Don't get me wrong, I love my granddaughter... but it's getting a tad tedious.",
    "winter_24_2": "Haha, Winter Star, the time to reminisce and get all soppy with gratitude.$1#$b#What am I grateful for? Well, I'm glad Clem's out of my life.",
    //Unique Courtship Responses - Requires the mod to be installed, otherwise does nothing. If it doesn't exist and the mod is installed though, the game will soft lock.
    "rejectNPCA": "Oh is this for a dare? I'll play along, if you give me a cut of the prize.$1",
    "rejectNPCB": "Oh don't tempt me, kitten. Though I'm afraid I've aged out of cougar and into jaguar. Or maybe sabertooth.$1",
    "refusal_no_heartsA": "You're quite the young upstart, aren't you?#$b#I've seen enough of flowers, thank you very much.$3", //they don't know you
    "refusal_no_heartsB": "I was married once. Didn't much enjoy it. And I'm not planning on doing it again.$a",
    "engageA": "Hah! Looking to add an old bat like me to your harem?$4#$b#Don't tempt me, kitten. I'd eat you alive.", //if you're already engaged, I guess?
    "engageB": "You're quite the Cassanova, aren't you just?$4#$b#That's a 'no', btw, in case you're confused.",
    "marriedA": "Hah! Looking to add an old bat like me to your harem?$4#$b#Don't tempt me, kitten. I'd eat you alive.", //if you're already married, I guess?
    "marriedB": "Polyamory? Been there, done that. It didn't end well.$3",
    //Datables:
    /* "give_flowersA": "",//accepting
    "give_flowersB": "",
    "give_pendant": "",//accepting
    "stardrop_gift": "",
    "reject_two_heartA": "",
    "reject_two_heartB": "",
    "reject_four_heartA": "",
    "reject_four_heartB":"",
    "refusal_knownA": "",
    "refusal_knownB": "",
    "refusal_botherA": "",
    "refusal_botherB":"",*/
    //Unique Jealousy Responses: - requires the mod. It basically means if you are caught giving a gift to someone else "single" your spouse won't necessarily get jealous: unless you lie about it, I suppose?
    //"giftquestion_yes": "",
    //"giftquestion_lie": "",
    //Conversation Topics (choose the ones you feel are most suited to your character) 
    //canon (most useful ones below) For a full list: https://stardewcommunitywiki.com/Modding:Dialogue
    //"joja_Begin": "",
    //"cc_Begin":"",
    //"cc_Bridge":"",
    "cc_Bus": "I've heard the bus is running again. I've never been to Calico Desert, you know.",
    //"cc_Boulder":"",
    //"cc_Greenhouse":"",
    "cc_Minecart": "It's strange having the minecarts running again. We used to lark around in them a bit in the younger days.#$b#Until Clem broke his ankle. His father put his foot down after that. The poor sod.$2",
    "cc_Complete": "Look at that, the old community center's been restored!#$b#Hope you're planning on making some new memories within those walls.$1",
    //"movieTheater": "",
    "GiftReaction_Ruby_Ring": "$1 VivienneRingReturn#I never thought I'd see this again. Oh dear, I think it's best you leave an old lady alone with her memories. But thank you for returning it to me, @. It means a lot."
    //Is this what I think it is? It really is. Never expected to see this again...#$b#The stone was a gift from a dear friend. It hurt to leave it behind.
    //Tori: My mother told me I saw the world through rose-tinted spectacles, and that someday it would come back to bite me.#$b#But I'd rather see the good in people than the bad, you know? I'd rather be naive and happy than cynical and miserable."
}